// 1 - Функции resolve и reject

// Сделайте промис, внутри которого будет задержка setTimeout в 3 секунды, 
// после которой промис должен зарезолвится (то есть выполнится успешно).

// Сделайте промис, внутри которого будет задержка setTimeout в 3 секунды, 
// после которой промис должен зареджектится (то есть выполнится с ошибкой).

// Сделайте функцию, которая будет генерировать случайные числа от 1 до 10. 
// Сделайте так, чтобы сгенерированное число было задержкой функции setTimeout в секундах. 
// Оберните все это в промис. 
// Пусть промис выполнится успешно, если сгенерировано число от 1 до 5, 
// и с ошибкой - если от 6 до 10.
