// Пример 1 - базовые операции с массивом

// Создайте массив styles с элементами «Джаз» и «Блюз».
const styles = [];
console.log(styles);
// Джаз, Блюз

// Добавьте «Рок-н-ролл» в конец.
console.log(styles);
// Джаз, Блюз, Рок-н-ролл

// Замените значение в середине на «Классика». 
// Код для замены значения в середине должен работать для массива любой длины.
console.log(styles);
// Джаз, Классика, Рок-н-ролл

// Удалите первый элемент и выведите его в консоль.
console.log();
// Джаз
console.log(styles);
// Классика, Рок-н-ролл

// Вставьте «Рэп» и «Регги» в начало массива.
console.log(styles);
// Рэп, Регги, Классика, Рок-н-ролл
