// 5 - Блиц
// На forEach
// Дан массив с числами. 
// Создайте новый массив, состоящий из квадратов этих чисел.

const arr = [5, 6, 7, 8, 9];

// Найдите сумму этих чисел.

// На map
// Дан массив с числами. Сделайте из него массив, состоящий из квадратов этих чисел.

// На every, some
// Дан массив с числами. Проверьте то, что все элементы в массиве больше нуля.
// Дан массив с числами. Проверьте то, что в нем есть отрицательные элементы.

// На filter
// Дан массив с числами. Оставьте в нем только отрицательные числа.
// Дан массив с числами. Оставьте в нем только четные числа.
// Дан массив со строками. Оставьте в нем только те строки, 
// длина которых больше 5-ти символов.
// Дан массив, в нем могут быть обычные элементы и подмассивы, например [1, 2, [3, 4], 5, [6, 7]]. 
// Оставьте в нем только подмассивы.
// Дан массив с числами. Посчитайте количество отрицательных чисел в этом массиве.
